Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་བཟང་ལ་མཛེས་ཤིང་ཡིད་དུ་འོང་བ། རིན་པོ་ཆེ་གྲངས་མེད་པའི་རྒྱན་བསམ་གྱིས་མ་ཁྱབ་པས་གྱ་ནོམ་པར་བརྒྱན་པ་ཡོད་དེ།
en: It was adorned with a splendid display of countless, beautiful jewels.

source: དེའི་ནང་ན་རྒྱལ་པོ་འོད་ཆེན་པོའི་དམ་པའི་ཆོས་གཅེས་པའི་དབྱིག་ཏུ་བྱ་བ་བཞུགས་སོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རིན་པོ་ཆེའི་འོབས་དེ་དག་ལ་ནི་ཆགས་པའི་སེམས་མྱེད། རིན་པོ་ཆེའི་ར་བ་དེ་དག་ལ་ནི་ངོ་མཚར་དུ་འཛིན་པའི་སེམས་མྱེད།
en: It was a treasury of the good Dharma that had been established by King Mahāprabha.

source: རིན་པོ་ཆེའི་ཏ་ལའི་འཕྲེང་བ་དེ་དག་ལ་ནི་འདོད་ཅིང་ཆགས་པ་མེད། རིན་པ་ཆེའི་དྲིལ་གྱི་དྲ་བའི་སྒྲ་ལ་ནི་རོ་མྱོང་བར་བྱེད་པ་མྱེད། ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྒྲ་དང་། གླུ་ང་རོ་སྙན་པའི་དབྱངས་ལ་ནི་ཆགས་པའི་སེམས་མྱེད། རིན་པོ་ཆེ་རྣམ་པ་ཐ་དད་པའི་གཞལ་མྱེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་སྣ་ཚོགས་ཀྱི་ལོངས་སྤྱོད་ནི་ཡིད་ལ་བྱ་བ་མེད་པར་ཤིན་ཏུ་དགའ་བར་གྱུར་པའི། སྐྱེས་པ་དང་བུད་མྱེད་ཀྱི་ཚོགས་ཀྱི་ཆོས་ཀྱི་དགའ་བའི་མོས་པས་ཤིན་ཏུ་དགའ་ཞིང་། གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་ལ་དགའ་བས་དབེན་པའི་སེམས་དང་ལྡན་པ།
en: Sudhana, the head merchant’s son, had no attachment toward the precious moats, he was not astonished by the precious walls, he had no craving for the rows of precious palm trees, he took no delight in the sounds from the networks of bells and little spherical bells, he had no clinging to the melodious sounds of the divine music and songs, he paid no attention to the delights of the celestial kūṭāgāras composed of various shining jewels, he found no pleasure in the pleasurable qualities of the groups of young men and women, and he was detached from the pleasures of form, sound, smell, taste, and touch.

source: ཆོས་ངེས་པར་བརྟགས་པ་ལ་ཤིན་ཏུ་མོས་པས་སེམས་ཅན་གང་དང་ཕྲད་ཀྱང་།
en: Focused on the contemplation of the Dharma, he asked whomever he met about the kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་རྟག་ཏུ་འདྲི་ཞིང་མཐར་གྱིས་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དྲུང་ཞིག་དུ་ཕྱིན་ནས་ཀུན་ཏུ་བལྟས་ན།
en: In that way, he eventually arrived at a place in the city where three roads met, and he looked around.

source: གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དབུས་ཀྱི་མཆོད་རྟེན་གྱི་ཁང་པ་ནས་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན། རྒྱན་ཆེན་པོ་དང་ལྡན་པའི་ཁྲི་ཆེན་པོ་བཻ་ཌྰུཪྻ་སྔོན་པོའི་རྐང་པ་བཀྱེ་བ།
en: He saw that not far from a caitya temple in the center of the junction of the three roads was a great throne with great adornments.

source: བཻ་ཌྰུཪྻ་དཀར་པོའི་སེང་གེས་བླངས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྕགས་པོད་ཀྱི་དྲ་བ་ལེགས་པར་བཏགས་པ། ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་རིན་པོ་ཆེའི་སྟན་སྣ་ཚོགས་བཏིང་བ།
en: It had legs of blue beryl, was supported by white beryl lions, was inlaid with a network of threads of Jambu River gold, and had various precious cushions, superior to divine materials, laid upon it.

source: རིན་པོ་ཆེའི་འབྲུ་གྲངས་མེད་པས་རྣམ་པར་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ།
en: It was adorned by countless precious disks and covered with an inconceivable network of an array of precious jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་སྣམ་བུ་ལ། ལྷ་རྫས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གུར་ཤིན་ཏུ་སྤ་བར་བཀྱེ་བའི་གནམ་ཡོལ་བྲེས་པ། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་པད་མོའི་སྙིང་པོ་དང་ལྡན་པ།
en: Above it there was a canopy like a tent made of cloth of Jambu River gold, with a variety of divine precious materials and a central lotus made of the kings of wish-fulfilling jewels.

source: དེ་ལྟུ་བུའི་ཆོས་ཀྱི་ཁྲི་ཆེན་པོ་ལ་རྒྱལ་པོ་འོད་ཆེན་པོ་མྱི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་ཤིན་ཏུ་བརྒྱན་པ་དཔེ་བྱད་བཟང་པོ་སྣ་ཚོགས་བརྒྱད་ཅུ་ཐམ་པས་ལུས་ཤིན་ཏུ་མཛེས་པ་གསེར་གྱི་རི་བོ་ལྟར་རིན་པོ་ཆེ་སྣ་ཚོགས་རྣམ་པར་བཀོད་པས་རྣམ་པར་མཛེས་པ་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་གཟི་བརྗིད་རབ་ཏུ་འབར་བ།
en: Seated cross-legged on that great Dharma throne was King Mahāprabha, whose body was adorned by the thirty-two signs of a great being. His body was beautified by the complete variety of the eighty features of a great being. He was like a mountain of gold. He was adorned with an array of various jewels. He shone magnificently like the disk of the sun.

source: ཟླ་བ་ཉ་ཞིང་རྒྱས་པའི་དཀྱིལ་འཁོར་ལྟར་ལྟ་ན་བཟང་བ།
en: He was lovely to look at like the disk of the full moon.

source: ཚངས་པ་ལྟར་ཚངས་པའི་འཁོར་གྱི་ནང་ན་རྣམ་པར་མཛེས་པ།
en: He was beautiful like Brahmā in the midst of his retinue of Brahmā devas.

source: རྒྱ་མཚོ་ལྟར་ཟབ་མོའི་ཆོས་དང་ཡོན་ཏན་མཐའ་ཡས་པའི་རིན་པོ་ཆེའི་ཚོགས་དང་ལྡན་པ།
en: He was like the ocean, possessing an accumulation of the jewels of the infinite qualities of the Dharma.

source: སྤྲིན་ཆེན་པོ་ལྟར་ཆོས་ཀྱི་རང་བཞིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་པ།
en: Like a great cloud he emitted the thunder that was the nature of the Dharma.

source: ནམ་མཁའ་ལྟར་ཆོས་ཀྱི་ཚུལ་གྱི་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: Like the sky he was adorned by the stars of the ways of the Dharma.

source: རི་རབ་ལྟར་ཁ་དོག་བཞི་པོའི་སེམས་ཅན་རྒྱ་མཚོའི་སེམས་ལ་གཟུགས་བརྙན་རབ་ཏུ་སྣང་བ་རིན་པོ་ཆེའི་གླིང་ལྟར་གཞི་ཡེ་ཤེས་སྣ་ཚོགས་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བ་དེ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་པ་མཐོང་ངོ་།
en: Like Sumeru his image appeared in the minds of the ocean of the four classes of beings. Like an island of jewels he was a ground filled with the jewels of various knowledges.

source: །དེའི་མདུན་ན་ཡང་གསེར་དང་ནོར་བུ་དང་མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་དུང་དང་མན་ཤེལ་དང་བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་དངུལ་རིན་པོ་ཆེའི་ཕུང་པོ་དང་། ལྷ་རྫས་ཀྱི་གོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཁ་ཟས་དང་སྤྱན་གཟིགས་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཞིམ་པའི་མཆོག་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དགོད་པ་དང་། དངར་བའི་ཐབས་སྣ་ཚོགས་ཀྱི་ཡུལ་དུ་བཀོད་པ་མཐོང་ངོ་།
en: Sudhana saw that arranged in front of King Mahāprabha there was a precious heap of gold, jewels, pearls, beryls, conch, crystal, corals, gold ornaments, and silver; a heap of divine clothing in various colors; a heap of various kinds of divine jewelry; a heap of food and various gifts; a heap of the various kinds of superior, supremely delicious flavors;

source: །ལྷ་རྫས་ཀྱི་ཤིང་རྟ་རིན་པོ་ཆེ་བྱེ་བ་བརྒྱ་སྟོང་དུ་མ་དང་། ལྷ་རྫས་ཀྱི་སིལ་སྙན་བྱེ་བ་བརྒྱ་སྟོང་དུ་མ་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་རྣམ་པ་བརྒྱ་སྟོང་དུ་མ་དང་། ནད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ཀྱི་ཕུང་པོ་དུ་མ་དང་། ཡོ་བྱད་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱི་ཕུང་པོ་སྤྱད་དུ་རུང་ཞིང་ཁ་ན་མ་ཐོ་བ་མེད་པ་མང་པོ་སེམས་ཅན་རྣམས་ཅི་དགའ་བར་སྤྱོད་དུ་གཟུད་པའི་ཕྱིར་བཤམས་ཏེ།
en: and a heap of a range of all kinds of displays. Sudhana saw many trillions of precious divine carriages, many trillions of precious divine musical instruments, many trillions of different kinds of divine perfumes, many heaps of medicine for healing sickness, and heaps of all kinds of particular utensils that were suitable, faultless, and for beings to use as they wish.

source: བཀོད་པ་དང་། བ་བཞོན་གསེར་གྱི་རུ་མྱིག་ཅན་སྟོང་ཕྲག་དུ་མ། འོ་མ་བྲེས་འཇལ་བ་མང་པོ་ཡང་སེམས་ཅན་ཕོངས་པ་རྣམས་ཡོངས་སུ་བསྡུ་བའི་ཕྱིར་བཀོད་པ་མཐོང་ངོ་།
en: Sudhana saw a hundred thousand young milk-yielding cows with golden horns and hooves set out for poor people to obtain.

source: བུ་མོ་རིན་པོ་ཆེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བཞིན་བཟང་བ།
en: Sudhana saw a quintillion precious maidens who had been assembled.

source: ཤིན་ཏུ་མཛེས་པ་ལྟ་ན་སྡུག་པ།
en: They were beautiful, attractive, and lovely to look at.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་ཀླུབས་པ། ལྷ་རྫས་ཀྱི་གོས་རིན་པོ་ཆེ་གྱོན་པ། ལྷ་རྫས་ཀྱི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོས་ལུས་བྱུགས་པ།
en: They were adorned in all jewelry and wore precious clothing of divine material, their bodies anointed with divine uragasāra sandalwood.

source: སྒྱུ་རྩལ་དྲུག་ཅུ་རྩ་བཞིའི་ཚུལ་ཤེས་པ།
en: They had mastered the sixty-four skills and were expert in all the arts of lovemaking.

source: འདོད་པའི་སྤྱོད་པ་དང་། ཆོ་ག་ཐམས་ཅད་ལ་མཁས་པ་དག་ཀྱང་བསྩོགས་ཤིང་བཀོད་པར་མཐོང་ངོ་། །དེའི་མདུན་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྡུ་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་གཟུང་བ་དང་། སེམས་ཅན་རྣམས་དགའ་བ་བསྐྱེད་པ་དང་། སེམས་ཅན་རྣམས་སྤྲོ་བ་བསྐྱེད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཡིད་དང་བར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཤིན་ཏུ་བདེ་བར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་རྣམ་པར་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཆོས་ཀྱི་རང་བཞིན་གྱི་དོན་ལ་ཡོངས་སུ་དགོད་པ་དང་། སེམས་ཅན་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དོན་མཉམ་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་གཞན་ལ་འཁུ་བ་རྣམ་པར་བཟློག་པར་བྱ་བ་དང་། ལུས་དང་ངག་གིས་ངན་དུ་སྤྱོད་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བའི་ཟུག་རྔུ་ཡང་དག་པར་དབྱུང་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལམ་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། སྲང་དང་ལམ་གྱི་བཞི་མདོ་དང་། ལམ་གྱི་སུམ་མདོ་དང་། སྒོ་དང་ཁྱམས་དག་ནའང་དེ་བཞིན་ཏེ། སྲང་རེ་རེའི་ངོས་གཡས་གཡོན་ནས་ཀྱང་སྟེགས་བུ་བྱེ་བ་ཉི་ཤུ་ཉི་ཤུ་ཙམ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཡོངས་སུ་སྤུངས་ཏེ་བཀོད་པ་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ནས་ཕྱག་བྱས་ཏེ།
en: Sudhana saw all these requisites gathered and arranged in front of the king for beings to collect, for beings to take, to bring happiness to beings, to bring joy to beings, to bring peace of mind to beings, to bring delight to beings, to cause the kleśas to cease within beings, to lead beings to the meaning of the nature of all phenomena, to direct beings to the meaning that is the same as omniscience, to turn beings away from ill will toward others, to turn beings away from bad physical and vocal actions, to extract the splinter of false views from beings, and for beings to purify their path of action. They were piled up and presented on two hundred million platforms at every crossroads of four streets, at every junction of three streets, and in front of the rows of doors and courtyards on both sides of every street.

source: རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: Sudhana, the head merchant’s son, prostrated his whole body onto the ground in homage to King Mahāprabha, and he circumambulated King Mahāprabha, keeping him to his right, many hundreds of thousands of times.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He then sat down before him, placed the palms of his hands together, and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྟེ།
en: King Mahāprabha said, “Noble one, I have purified and perfected the bodhisattva conduct called the banner of great love

source: རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ཡང་སངས་རྒྱས་བརྒྱ་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཡོངས་སུ་དྲིས་སོ། ཡོངས་སུ་ཞུས་སོ། རྣམ་པར་སྦྱངས་སོ། ཡོངས་སུ་སྦྱངས་སོ། རྣམ་པར་བཀོད་དོ། རྣམ་པར་བལྟས་སོ།
en: “Noble one, I addressed questions about this bodhisattva conduct called the banner of great love to many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many quintillions of buddhas, and so on up to an innumerable number of innumerable numbers of buddha bhagavats.

source: རྣམ་པར་དཔྱད་དོ། རྗེས་སུ་བཙལ་ཏོ། ཡོངས་སུ་བརྟགས་སོ། རྣམ་པར་བྲིས་སོ། རྒྱ་ཆེར་བྱས་སོ།
en: From them I received it, purified it, completely purified it, established it, viewed it, analyzed it, followed it, sought it, examined it, wrote it out, and promulgated it.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ལ་གནས་ཤིང་ཆོས་དང་འཐུན་པར་ཁམས་སྐྱོང་ཞིང་སྟོན་ཏོ། །ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་ལ་ཕན་པར་བྱེད་དོ། །ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་ན་རྗེས་སུ་སྤྱོད་དོ། །ཆོས་དང་འཐུན་པར་སེམས་ཅན་བཅོས་བ་བྱེད་དོ། ཆོས་དང་འཐུན་པར་སེམས་ཅན་རྣམས་ལ་ནན་ཏན་བྱེད་དོ། ཆོས་ཀྱི་དཀྱིལ་འཁོར་ལ་སེམས་ཅན་རྣམས་ཡོངས་སུ་འཛུད་དོ། ཆོས་ཀྱི་ཚུལ་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་བསྒྲུབ་བོ། ཆོས་དང་འཐུན་པར་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བསྒོ་བ་བྱེད་དོ། ཆོས་ཀྱི་ནན་ཏན་ལ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྦྱོར་རོ། ཆོས་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་དོ། །བྱམས་པའི་སེམས་དང་། བྱམས་པ་ཆེན་པོའི་དབང་དང་། བྱམས་པའི་སྟོབས་དང་། ཕན་པའི་སེམས་དང་། བདེ་བའི་སེམས་དང་། སྙིང་རྗེའི་སེམས་དང་། ཕན་འདོག་པའི་སེམས་དང་། ཡོངས་སུ་བསྲུང་བའི་སེམས་དང་། སེམས་ཅན་ཡོངས་སུ་འཛིན་པ་མི་གཏོང་བའི་སེམས་དང་། སྡུག་བསྔལ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་སྨོན་ལམ་རྒྱུན་མི་གཅོད་པའི་སེམས་དང་། བདེ་བའི་མཐར་ཕྱིན་པ་ལ་རབ་ཏུ་དགོད་པར་ཡང་དག་པར་སྤྱོད་པ་རྒྱུན་མི་གཅོད་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་དོ།
en: “Noble one, in that way I have remained in this bodhisattva conduct called the banner of great love , and I rule the kingdom in accord with the Dharma, I take care of the world in accord with the Dharma, I carry out conduct in the world in accord with the Dharma, I cause beings to be in accord with Dharma, I bring beings into the domain of the Dharma, I bring beings into the way of the Dharma, I command beings in accord with Dharma, I make beings dedicate themselves to the practice of the Dharma, I establish beings in the understanding of the nature of the Dharma, and I establish beings in a loving state of mind, in the power of great love, in the strength of love, in an altruistic state of mind, in a happy state of mind, in a sympathetic state of mind, in a caring state of mind, in a protective state of mind, in a state of mind that never ceases to be protective of beings, and in a state of mind of continuously aspiring to eliminate all suffering, and I establish beings in a continuous conduct that leads them to the ultimate happiness.

source: བག་ཡངས་ཀྱི་བདེ་བ་ཡང་དག་པར་བསྐྱེད་པས་སེམས་ཅན་དེ་དག་གི་ལུས་ཀྱང་ཤིན་ཏུ་བདེ་བར་བྱེད་དོ།
en: “I also bring physical ease to beings by giving rise to the happiness of serenity.

source: །དེ་དག་གི་འཁོར་བའི་བདེ་བ་ལ་ཞེན་པའི་སེམས་ཀྱི་རྒྱུད་ཀྱང་རྣམ་པར་བཟློག་པ་བྱེད་དོ།
en: I turn the continuums of their minds away from attachment to the pleasures of saṃsāra.

source: དེ་དག་གི་སེམས་ཀྱི་རྒྱུན་ཀྱང་ཆོས་ཀྱི་དགའ་བ་དང་མོས་པ་ལ་ཡོངས་སུ་གཞོལ་བར་བྱེད་དོ།
en: I bring beings to delight in the pleasures of the Dharma.

source: །ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་ལས་རྣམ་པར་སྦྱོང་བ་བྱེད་དོ། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་ཡོངས་སུ་སྦྱོང་བ་བྱེད་དོ།
en: I cleanse them of all the stains of the kleśas. I purify them of all bad qualities.

source: འཁོར་བའི་རྒྱུན་ལས་རྣམ་པར་བཟློག་པ་བྱེད་དོ།
en: I turn them away from the continuum of saṃsāra.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཡོངས་སུ་གཟུད་པ་བྱེད་དོ།
en: I turn them toward the ocean of the ways of the realm of Dharma.

source: །དེ་དག་གིས་སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་ཐམས་ཅད་རྒྱུན་གཅད་པའི་ཕྱིར། སེམས་ཀྱི་མ་རིག་པ་ཡོངས་སུ་བསྲག་པ་བྱེད་དོ།
en: I burn away the ignorance in their minds in order to end all rebirths in the states of existence.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་འབྲས་བུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དེ་དག་གི་སེམས་ཀྱི་མྱུ་གུ་བསྐྱེད་དོ།
en: I cause light to arise in their minds so that they attain the result that is omniscience.

source: མི་འཕྲོགས་པའི་དད་པའི་སྟོབས་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་དེ་དག་གི་སེམས་ཀྱི་རྒྱ་མཚོ་ཡང་རབ་ཏུ་དང་བར་བྱེད་དོ།
en: I make the ocean of their minds clear so that they will give rise to the strength of unassailable faith.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་ལ་གནས་ཏེ། ཆོས་དང་འཐུན་པར་འཇིག་རྟེན་སྐྱོང་ཞིང་སྟོན་ཏོ།
en: “Noble one, in that way I have remained in this bodhisattva conduct called the banner of great love , and I rule the kingdom in accord with the Dharma.

source: རིགས་ཀྱི་བུ་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་རྣམས་ནི་ངས་འཇིགས་ཤིང་སྡང་པའམ། བག་ཚ་ཞིང་སྐྱི་གཡའ་བ་མེད་དེ།
en: “Noble one, I do not cause the beings who dwell in my realm to be frightened, terrified, or alarmed or to horripilate.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་ཕོངས་ཤིང་ཡོ་བྱད་སྣ་ཚོགས་ཀྱིས་བྲེལ་བ། བཟའ་བ་འདོད་པའམ། བཏུང་བ་འདོད་པའམ། གོས་འདོད་པ་ནས་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་གང་འདོད་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ངའི་དྲུང་དུ་འོང་ངོ་།
en: “Noble one, those beings who are poor and deprived of necessities, who wish for food, who wish for drink, who wish for clothes, and who wish for every kind of requisite all come before me.

source: །དེ་དག་ལའང་ངས་སྔ་ནས་བཤམ་བཤམ་པའི་མཛོད་སྒོ་ཕྱེ་ཞིང་ཅི་འདོད་པ་ཁྱེར་ཅིག་ཅེས་བསྟབས་ཏེ། གང་གི་དོན་དུ་ཁྱེད་སྡིག་པའི་ལས་ལ་སྤྱོད་པར་གྱུར་ཅིང་། སྲོག་གཅོད་པའམ། མ་བྱིན་པར་ལེན་པའམ། འདོད་པས་ལོག་པར་གཡེམ་པའམ། བརྫུན་དུ་སྨྲ་བ་འམ། ཕྲ་མ་འམ། ངག་རྩུབ་པོའམ། ཚིག་ཀྱལ་པའམ། ཆགས་སེམས་དང་། གནོད་སེམས་སམ། ལོག་པར་ལྟ་བའམ།
en: I open the door to the treasures that I have previously accumulated, and I say to them, ‘Take whatever you wish—all those things for which you would otherwise engage in the bad actions of killing, taking what has not been given, sexual misconduct, lying, slander, harsh speech, idle talk, craving, malice, false views, and attachment to various incorrect views!

source: དེ་མ་ཡིན་པའི་ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་འདིའི་སྒོ་དང་། སྲང་དང་། ཁྱམས་དང་། ལམ་གྱི་སུམ་མདོ་དང་། བཞི་མདོ་ཀུན་ཏུ་སྤུངས་ཏེ། སྔ་ནས་བྱིན་པ་ཡིན་གྱི། སུ་ཅི་འདོད་པ་ཀུན་ཀྱང་ཁྱེར་ཅིག་ཅེས་བསྟབས་ཤིང་བྱིན་ནོ།
en: All of those things have been provided by me, and they are heaped at the doors in the streets, in the courtyards, at the junctions of three streets, and at the crossroads of four streets in this great city of Suprabha —anyone may take whatever they wish!’ I tell them this and give it to them.

source: །རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་འོད་བཟང་པོ་འདི་ན་སེམས་ཅན་ཇི་སྙེད་ཅིག་གནས་པ་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྟེ་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའོ།
en: “Noble one, all the beings who dwell in this great city are bodhisattvas who follow the Mahāyāna.

source: །དེ་བས་ན་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་འདི་ཡང་དེ་དག་ལ་བསམ་པ་རྣམ་པ་ཇི་ལྟ་བུར་དག་པའི་ཚུལ་བཞིན་དུ་སྣང་སྟེ།
en: “Noble one, this great city of Suprabha appears to them in accordance with their way of thinking:

source: ལ་ལ་ལ་ནི་དོག་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་ཡངས་པར་སྣང་ངོ་།
en: to some it appears small, while to some it appears vast;

source: །ལ་ལ་ལ་ནི་གཞིས་ལ་གནས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་གཞི་རིན་པོ་ཆེ་བཻ་ཌཱུརྱ་ལས་བླངས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་སའི་ར་བས་བསྐོར་བར་སྣང་ངོ་།
en: to some the ground appears to be made of earth, while to some the ground appears to be made of beryl jewels;

source: །ལ་ལ་ལ་ནི་རིན་པོ་ཆེ་རྡོ་རྗེ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ར་བས་བསྐོར་བར་སྣང་ངོ་།
en: to some it appears to be encircled by a wall of clay, while to some it appears to be encircled by a wall of precious diamonds and banners of invincibility;

source: །ལ་ལ་ལ་ནི་གསེག་མ་དང་གྱོ་མོས་གང་ཞིང་ཐག་ཐུག་དང་གྲོག་པོ་དང་། གཡང་ས་མང་པོ་ཅན་དུ་སྣང་ངོ་། །ལ་ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་གྲངས་མེད་པས། གཞི་བརྒྱན་ཅིང་ཡོངས་སུ་བཀྲམ་པ་དང་། ལག་མཐིལ་བཞིན་དུ་གཞི་མཉམ་པར་སྣང་ངོ་།
en: to some it appears to be filled with pebbles and potsherds, to be uphill and downhill, and to have many chasms and precipices, while to some it appears to have ground that is covered and adorned with countless excellent precious jewels and to be as flat as the palm of the hand;

source: །ལ་ལ་ལ་ནི་ས་ལས་བྱས་པར་སྣང་ངོ་། །ལ་ལ་ལ་ནི་རིན་པོ་ཆེ་གྲངས་མེད་པའི་ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་བཟང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་སྟེང་དང་། བ་གམ་དང་། སྐར་ཁུང་གི་ཤར་བུ་དང་། ཟླ་གམ་རིན་པོ་ཆེ་སེང་གེའི་དྲ་བས་བརྒྱན་པར་སྣང་ངོ་།
en: to some it appears to be made of earth, while to some it appears to be adorned by countless precious dwellings, aerial palaces, mansions, and kūṭāgāras adorned by roof decks with balustrades, spires, round windows, networks of strings of beads, crescent moons, and trellises of lion adornments.

source: །གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ན་གནས་པའི་སེམས་ཅན་སྔོན་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུས་པ།
en: “Among the beings who live outside the city, there are those who, when I was practicing bodhisattva conduct in past lives, gathered around me as pupils through the four methods of gathering pupils.

source: བསམ་པ་དག་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་མང་པོ་བསྙེན་བཀུར་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་པར་མོས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རབ་ཏུ་གཞོལ་བ་དེ་དག་ལ་ཡང་རིན་པོ་ཆེ་ལས་བྱས་པར་སྣང་ངོ་།
en: They have pure motivation, have created the roots of merit, have served many buddhas, aspire to omniscience, and are set on omniscience. To them the city appears to be made of jewels.

source: །དེ་མ་ཡིན་པ་གཞན་དག་ལ་ནི་ས་ལས་བྱས་པར་སྣང་སྟེ།
en: To the others it appears to be made of earth.

source: རིགས་ཀྱི་བུ་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་ཡུལ་དང་ཕྱོགས་དང་། གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དག་ན་རྙོག་པ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་དུས་ཀྱི་རང་བཞིན་གྱིས་དཀྲུགས་ཏེ། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཞིག་བྱེད་པར་འདོད་པར་གྱུར་ན་ཡང་། དེའི་ཚེ་ང་དེ་དག་ལ་ཕན་པར་བྱ་བའི་སེམས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ཞེས་བྱ་བ་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: “Noble one, when the beings who live in my realm, in the districts and subdistricts, in the villages, towns, and markets, in the country and the capital, are disturbed by the nature of the times in a world that has the five degenerations and want to practice the path of the ten bad actions, then at that time, wishing to benefit them, I enter the bodhisattva samādhi called exercising power over the world through being motivated by great love

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་པ་དང་། དེ་ཉིད་ཀྱི་མོད་ལ་སེམས་ཅན་དེ་དག་གི་འཇིགས་པ་དེ་དག་དང་མི་བདེ་བ་དེ་དག་དང་། ཤར་གཉེར་བ་དེ་དག་དང་ཐབ་མོ་དང་རྩོད་པ་དེ་དག་དང་། སེམས་ཀྱི་འཁྲུག་པ་དེ་དག་དང་། འཚེ་བའི་སེམས་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་དེའི་ཆོས་ཉིད་ཐོབ་པས་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །ཉེ་བར་ཞི་བར་གྱུར་ཏོ། །རྣམ་པར་ལྡོག་པར་གྱུར་ཏོ། །འགག་པར་གྱུར་ཏོ།
en: “Noble one, as soon as I rest in that samādhi, the fears, misfortunes, hostilities, disputes, mental disturbances, and violent intentions of those beings cease, are extinguished, are eliminated, and are brought to an end through their attaining the nature of the bodhisattva samādhi called exercising power over the world through being motivated by great love

source: །རིགས་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་དང་དེའུ་རེ་མངོན་སུམ་དུ་འགྱུར་རོ།
en: “Noble one, stay a moment and you will see a sight.”

source: །དེ་ནས་རྒྱལ་པོ་འོད་ཆེན་པོས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ལ་མཉམ་པར་གཞོག་གོ །དེ་ལྟར་རྒྱལ་པོ་འོད་ཆེན་པོས།
en: Then King Mahāprabha entered the bodhisattva samādhi called exercising power over the world through being motivated by great love

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི། སྔོན་དུ་འགྲོ་བ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ་དེའི་མོད་ལ་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་ཡུལ་དང་། ཕྱོགས་སུ་བཅས་པ། གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གི་འཁོར་དང་བཅས་པ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: As soon as he entered the bodhisattva samādhi called exercising power over the world through being motivated by great love , the great city of Suprabha and its districts and subdistricts, its villages, towns, and markets, the land and the kingdom, the capital, and its environs all shook in six ways.

source: །དེ་གཡོས་པའི་ཚེ་རིན་པོ་ཆེའི་ར་བ་དེ་དག་དང་རིན་པོ་ཆེའི་ཁང་པ་དང་། རིན་པོ་ཆེའི་སྙིང་པོ་དང་། རིན་པོ་ཆེའི་ཁྱིམ་དང་། རིན་པོ་ཆེའི་གནས་དང་། རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་དང་། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དང་། རིན་པོ་ཆེའི་བ་གམ་དང་། རིན་པོ་ཆེའི་པུ་ཤུ་དང་། རིན་པོ་ཆེའི་སྐར་ཁུང་དང་། རིན་པོ་ཆེའི་སྟེགས་བུ་དང་། རིན་པོ་ཆེའི་རྟ་བབས་དང་། རིན་པོ་ཆེའི་ཟླ་གམ་དང་། རིན་པོ་ཆེའི་སེང་གེའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་ལན་ཀན་དང་། རིན་པོ་ཆེའི་འབྲུ་དང་། རིན་པོ་ཆེའི་བླ་རེ་དང་། རིན་པོ་ཆེའི་སྲད་བུས་བརྒྱུས་པའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། རིན་པོ་ཆེའི་བ་དན་དང་། རིན་པོ་ཆེའི་ཏ་ལ་དེ་དག་ཀྱང་རབ་ཏུ་གཡོས་ཏེ། སྒྲ་འབྱིན་ཏོ། རབ་ཏུ་འཁྲོལ་ལོ།
en: When they shook, the precious walls, precious mansions, precious interiors, precious houses, precious dwellings, precious aerial palaces, precious kūṭāgāras, precious spires, precious balustrade rooftops, precious round windows, precious balconies, precious toraṇas, precious crescents, precious lattices of lion adornments, precious railings, precious disks, precious canopies, precious strings of little spherical bells, precious bells, precious banners, precious flags, and precious palm trees also shook, made loud sounds, and jingled.
